clc              
clear all      %Å«ò ò—œ‰ Å‰ç—Â ›—„«‰ Ê Õ«›ŸÂ%
close all
format shortG


d=xlsread('data.xlsx');                %ŒÊ«‰œ‰ «ÿ·«⁄«  «ò”·%

w=d(1,:);                         %ŒÊ«‰œ‰ ”ÿ— Ê“‰ „⁄Ì«—Â«%         

d(1:2,:)=[];                                %Ã«Ì „« —Ì”  ’„Ì„%

[n1, n2]=size(d);                 %„Õ«”»Â «‰œ«“Â „« —Ì”  ’„Ì„%

pw=abs(w)./sum(abs(w));            % ‘òÌ· „« —Ì”  ’„Ì„%

%%

r=zeros(n1,n2);                %„« —Ì”Ì »—«Ì ‰êÂ œ«—Ì „ﬁ«œÌ— r(»—«Ì —«»ÿÂ2)%    

for i=1:n2
r(:,i)=d(:,i)./sqrt(sum(d(:,i).^2));      %«” «‰œ«œ ‰„Êœ‰ œ«œÂ Â« ÿ»ﬁ —«»ÿÂ2%
end

%% 
T=zeros(n1,n2);                         %„« —Ì”Ì »—«Ì ‰êÂ œ«—Ì „ﬁ«œÌ—T Ì« „« —Ì” »Ì „ﬁÌ«” Ê“Ì‰%

for i=1:n2
T(:,i)=r(:,i)*(pw(i));                  %÷—» „ﬁ«œÌ— „« —Ì” ‰—„«· œ— Ê“‰. („« —Ì” »Ì „ﬁÌ«” Ê“‰ œ«—) —«»ÿÂ 4%
end

%% 
Aw=zeros(1,n2);                       % „« —Ì”Ì »—«Ì ‰êÂ œ«—Ì —«Â Õ· «ÌœÂ «· Ê ÷œ «ÌœÂ ¬·%
Ab=zeros(1,n2);

for i=1:n2                             
    if w(i)<0;
Aw(1,i)=max(T(:,i));
Ab(1,i)=min(T(:,i));                 %  ⁄ÌÌ‰ »«·« —Ì‰ Ê Å«ÌÌ‰  —Ì‰ ⁄„·ò—œ Â— ‘«Œ’(—«»ÿÂ 5Ê 6)% 
    else
Ab(1,i)=max(T(:,i));
Aw(1,i)=min(T(:,i));        
    end
end


%% 

dw=zeros(n1,1);                      % „« —Ì”Ì »—«Ì ‰êÂ œ«—Ì „⁄Ì«— ›«’·Â «ÌÌ «ÌœÂ «· Ê ÷œ «ÌœÂ «·%
db=zeros(n1,1);

for i=1:n1
    s1=0;
    s2=0;
    for j=1:n2   
    s1=s1+sum((T(i,j)-Aw(j)).^2);                         % ⁄ÌÌ‰ „⁄Ì«— ›«’·Â «ÌÌ »—«Ì ¬· —‰« ÌÊ «ÌœÂ ¬· Ê ÷œ «ÌœÂ ¬·(—«»ÿÂ7Ê8)%
    s2=s2+sum((T(i,j)-Ab(j)).^2);    
    end
    
    dw(i)=s1;
    db(i)=s2;
end

%% 
Sw=zeros(n1,1);
for i=1:n1    
Sw(i)=dw(i)/(dw(i)+db(i));                                 %„Õ«”»Â ÷—Ì» ‰Â«ÌÌ (—«»ÿÂ9)%
end

%% 

[e1, e2]=sort(Sw,'descend');                                    %„— » ”«“Ì ÃÊ«»%
disp('------------------------------------------------')         %‰„«Ì‘ ÃÊ«» Â«(— »Â-ê“Ì‰Â-swÌ« Â„«‰ *C%
disp( '           Rank          Alter     Sw '  )
disp('------------------------------------------------')
disp([(1:n1)',e2,e1])
disp('------------------------------------------------')

[e1, e2]=sort(dw,'descend');                                    %„— » ”«“Ì ÃÊ«»%
disp('------------------------------------------------')         %‰„«Ì‘ ÃÊ«» «ÌœÂ ¬·dw Ì« Â„«‰ *S%
disp( '           Rank          Alter     dw '  )
disp('------------------------------------------------')
disp([(1:n1)',e2,e1])
disp('------------------------------------------------')

[e1, e2]=sort(db,'descend');                                    %„— » ”«“Ì ÃÊ«»%
disp('------------------------------------------------')         %‰„«Ì‘ ÃÊ«» ÷œ «ÌœÂ ¬· db Ì« Â„«‰ -S%
disp( '           Rank          Alter     db '  )
disp('------------------------------------------------')
disp([(1:n1)',e2,e1])
disp('------------------------------------------------')

digits(7);


digits(7);
